## Top Three Salaries per Department

In [1]:
import pandas as pd
import sqlite3
import sql
sql.style = 'plain'
%load_ext sql
connection=sqlite3.connect("question_bank.db")
print("Successfully connected to SQL database")
# Connect to SQLite
%sql sqlite:///question_bank.db
print("success")

Successfully connected to SQL database
success

In [2]:
%%sql

DROP TABLE IF EXISTS Employee;

CREATE TABLE Employee (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    salary INT,
    departmentId INT,
    FOREIGN KEY (departmentId) REFERENCES Department(id)
);

INSERT INTO Employee (id, name, salary, departmentId) VALUES
(1, 'Joe', 85000, 1),
(2, 'Henry', 80000, 2),
(3, 'Sam', 60000, 2),
(4, 'Max', 90000, 1),
(5, 'Janet', 69000, 1),
(6, 'Randy', 85000, 1),
(7, 'Will', 70000, 1);

 * sqlite:///question_bank.db
Done.
Done.
7 rows affected.

[]

In [3]:
%%sql

CREATE TABLE Department (
    id INT PRIMARY KEY,
    name VARCHAR(50)
);

INSERT INTO Department (id, name) VALUES
(1, 'IT'),
(2, 'Sales');

 * sqlite:///question_bank.db
Done.
2 rows affected.

[]

In [4]:
%%sql
SELECT * FROM Employee

 * sqlite:///question_bank.db
Done.

[(1, 'Joe', 85000, 1),
 (2, 'Henry', 80000, 2),
 (3, 'Sam', 60000, 2),
 (4, 'Max', 90000, 1),
 (5, 'Janet', 69000, 1),
 (6, 'Randy', 85000, 1),
 (7, 'Will', 70000, 1)]

In [5]:
%%sql
SELECT * FROM Department

 * sqlite:///question_bank.db
Done.

[(1, 'IT'), (2, 'Sales')]

In [6]:
%%sql

-- We need to find - top 3 salaries of each departmemt
-- There are two dept - IT and Sales
-- We will ll use PARTITION BY dept_name
-- DENSE_RANK -- multiple people with same salary can get same rank 
-- you get exclusive 2nd, 3rd salary


SELECT d.name,e.name,e.salary, 
    DENSE_RANK () OVER (PARTITION BY d.name ORDER BY e.salary DESC) AS rk
FROM Employee e
JOIN Department d ON e.departmentId=d.id


-- This becomes a inner sub query

 * sqlite:///question_bank.db
Done.

[('IT', 'Max', 90000, 1),
 ('IT', 'Joe', 85000, 2),
 ('IT', 'Randy', 85000, 2),
 ('IT', 'Will', 70000, 3),
 ('IT', 'Janet', 69000, 4),
 ('Sales', 'Henry', 80000, 1),
 ('Sales', 'Sam', 60000, 2)]

In [7]:
%%sql

SELECT *
FROM (
    SELECT d.name,e.name,e.salary, 
        DENSE_RANK () OVER (PARTITION BY d.name ORDER BY e.salary DESC) AS rk
    FROM Employee e
    JOIN Department d ON e.departmentId=d.id
)
WHERE rk<=3

 * sqlite:///question_bank.db
Done.

[('IT', 'Max', 90000, 1),
 ('IT', 'Joe', 85000, 2),
 ('IT', 'Randy', 85000, 2),
 ('IT', 'Will', 70000, 3),
 ('Sales', 'Henry', 80000, 1),
 ('Sales', 'Sam', 60000, 2)]

* Top Three Salaries per Department

In [8]:
%%sql

SELECT *
FROM (
    SELECT d.name,e.name,e.salary, 
        DENSE_RANK () OVER (PARTITION BY d.name ORDER BY e.salary DESC) AS rk
    FROM Employee e
    JOIN Department d ON e.departmentId=d.id
)
WHERE rk=1

 * sqlite:///question_bank.db
Done.

[('IT', 'Max', 90000, 1), ('Sales', 'Henry', 80000, 1)]